/** @type {import('tailwindcss').Config} */
export default {
  content: [
    "./index.html",
    "./src/**/*.{js,ts,jsx,tsx}",
  ],
  theme: {
    extend: {
      colors: {
        // نستبدل اللون الأزرق الافتراضي بلونك الخاص
        blue: {
          50: '#f0f9ff',
          100: '#e0f2fe',
          200: '#bae6fd',
          300: '#7dd3fc',
          400: '#38bdf8',
          500: '#0ea5e9',
          600: '#0e395c', // 👈 ده اللون الأساسي (الأزرار والعناوين)
          700: '#0b2d49', // 👈 ده لون الـ Hover (أغمق سنة)
          800: '#075985',
          900: '#0c4a6e',
        },
      },
      fontFamily: {
        // نضبط الخط العربي كافتراضي
        sans: ['Zain', 'sans-serif'],
      },
    },
  },
  plugins: [],
}
